apple-open-source/macos/IOUSBFamily/IOUSBUserClient/Classes/IOUSBInterfaceUserClientV3.cpp
   { //    kUSBInterfaceUserClientSupportsStreams
		(IOExternalMethodAction) &IOUSBInterfaceUserClientV3::_supportsStreams,
		1, 0,
		1, 0
    },
    { //    kUSBInterfaceUserClientCreateStreams
		(IOExternalMethodAction) &IOUSBInterfaceUserClientV3::_createStreams,
		2, 0,
		0, 0
    },
	{
		//kUSBInterfaceUserClientGetConfiguredStreams
		(IOExternalMethodAction) &IOUSBInterfaceUserClientV3::_getConfiguredStreams,
		1, 0,
		1, 0
	},
    { //    kUSBInterfaceUserClientReadStreamsPipe
		(IOExternalMethodAction) &IOUSBInterfaceUserClientV3::_ReadStreamsPipe,
		6, 0,
		0, 0xffffffff
    },
    { //    kUSBInterfaceUserClientWriteStreamsPipe
		(IOExternalMethodAction) &IOUSBInterfaceUserClientV3::_WriteStreamsPipe,
		6, 0xffffffff,
		0, 0
    },
    { //    kUSBInterfaceUserClientAbortStreamsPipe
		(IOExternalMethodAction) &IOUSBInterfaceUserClientV3::_AbortStreamsPipe,
		2, 0,
		0, 0
    }
};


#pragma mark -

IOReturn
IOUSBInterfaceUserClientV3::externalMethod(
													uint32_t                    selector,
													IOExternalMethodArguments * arguments,
													IOExternalMethodDispatch *  dispatch,
													OSObject *                  target,
													void *                      reference)
{
	
    if (selector < (uint32_t) kIOUSBLibInterfaceUserClientV3NumCommands)
    {
        dispatch = (IOExternalMethodDispatch *) &sV3Methods[selector];
        
        if (!target)
            target = this;
    }
	
	return IOUserClient::externalMethod(selector, arguments, dispatch, target, reference);
}

#pragma mark Streams

IOReturn IOUSBInterfaceUserClientV3::_supportsStreams(IOUSBInterfaceUserClientV3 * target, void * reference, IOExternalMethodArguments * arguments)
{
#pragma unused (reference)
	USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::_supportsStreams",  target);
	
	target->retain();
	IOReturn kr = target->SupportsStreams((UInt8)arguments->scalarInput[0], &(arguments->scalarOutput[0]));
	target->release();
	
	return kr;
}

IOReturn
IOUSBInterfaceUserClientV3::SupportsStreams(UInt8 pipeRef, uint64_t *supportsStreams)
{
    IOUSBPipeV2 		*pipeObjV2;
    IOReturn			ret = kIOReturnSuccess;
	
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::SupportsStreams for pipe %d, isInactive: %d",  this, pipeRef, isInactive());
	
	IncrementOutstandingIO();
    if (fOwner && !isInactive())
    {
		pipeObjV2 = (IOUSBPipeV2 *) GetPipeObj(pipeRef);
		
		if (pipeObjV2 && OSDynamicCast(IOUSBPipeV2, pipeObjV2))
		{
			*supportsStreams = pipeObjV2->SupportsStreams();
			pipeObjV2->release();
		}
		else
			ret = kIOUSBUnknownPipeErr;
    }
    else
        ret = kIOReturnNotAttached;
	
    if (ret)
	{
		USBLog(3, "IOUSBInterfaceUserClientV3[%p]::SupportsStreams - returning err 0x%x (%s)", this, ret, USBStringFromReturn(ret));
	}
	else
	{
		USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::SupportsStreams for pipe %d: %qd",  this, pipeRef, *supportsStreams);
	}
	
    DecrementOutstandingIO();
    return ret;
}


IOReturn IOUSBInterfaceUserClientV3::_createStreams(IOUSBInterfaceUserClientV3 * target, void * reference, IOExternalMethodArguments * arguments)
{
#pragma unused (reference)
	USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::_createStreams",  target);
	
	target->retain();
	IOReturn kr = target->CreateStreams((UInt8)arguments->scalarInput[0], (UInt32)arguments->scalarInput[1]);
	target->release();
	
	return kr;
}

IOReturn
IOUSBInterfaceUserClientV3::CreateStreams(UInt8 pipeRef, UInt32 maxStreams)
{
    IOUSBPipeV2 		*pipeObjV2;
    IOReturn			ret = kIOReturnSuccess;
	
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::CreateStreams for pipe %d, isInactive: %d",  this, pipeRef, isInactive());
	
	IncrementOutstandingIO();
    if (fOwner && !isInactive())
    {
		pipeObjV2 = (IOUSBPipeV2 *) GetPipeObj(pipeRef);
		
		if (pipeObjV2 && OSDynamicCast(IOUSBPipeV2, pipeObjV2))
		{
			ret = pipeObjV2->CreateStreams(maxStreams);
			pipeObjV2->release();
		}
		else
			ret = kIOUSBUnknownPipeErr;
    }
    else
        ret = kIOReturnNotAttached;
	
    if (ret)
	{
		USBLog(3, "IOUSBInterfaceUserClientV3[%p]::CreateStreams - returning err 0x%x (%s)", this, ret, USBStringFromReturn(ret));
	}
	
    DecrementOutstandingIO();
    return ret;
}


IOReturn IOUSBInterfaceUserClientV3::_getConfiguredStreams(IOUSBInterfaceUserClientV3 * target, void * reference, IOExternalMethodArguments * arguments)
{
#pragma unused (reference)
	USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::_getConfiguredStreams",  target);
	
	target->retain();
	IOReturn kr = target->GetConfiguredStreams((UInt8)arguments->scalarInput[0], &(arguments->scalarOutput[0]));
	target->release();
	
	return kr;
}

IOReturn
IOUSBInterfaceUserClientV3::GetConfiguredStreams(UInt8 pipeRef, uint64_t *configuredStreams)
{
    IOUSBPipeV2 		*pipeObjV2;
    IOReturn			ret = kIOReturnSuccess;
	
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::GetConfiguredStreams for pipe %d, isInactive: %d",  this, pipeRef, isInactive());
	
	IncrementOutstandingIO();
    if (fOwner && !isInactive())
    {
		pipeObjV2 = (IOUSBPipeV2 *) GetPipeObj(pipeRef);
		
		if (pipeObjV2 && OSDynamicCast(IOUSBPipeV2, pipeObjV2))
		{
			*configuredStreams = pipeObjV2->SupportsStreams();
			pipeObjV2->release();
		}
		else
			ret = kIOUSBUnknownPipeErr;
    }
    else
        ret = kIOReturnNotAttached;
	
    if (ret)
	{
		USBLog(3, "IOUSBInterfaceUserClientV3[%p]::GetConfiguredStreams - returning err 0x%x (%s)", this, ret, USBStringFromReturn(ret));
	}
	else
	{
		USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::GetConfiguredStreams for pipe %d: %qd",  this, pipeRef, *configuredStreams);
	}
	
    DecrementOutstandingIO();
    return ret;
}


#pragma mark Overriden Methods
IOReturn
IOUSBInterfaceUserClientV3::ReadPipe(UInt8 pipeRef, UInt32 noDataTimeout, UInt32 completionTimeout, mach_vm_address_t buffer, mach_vm_size_t size, IOUSBCompletion * completion)
{
	return ReadStreamsPipe(pipeRef, 0, noDataTimeout, completionTimeout, buffer, size, completion);
}


IOReturn
IOUSBInterfaceUserClientV3::ReadPipe(UInt8 pipeRef, UInt32 noDataTimeout, UInt32 completionTimeout, void *buf, UInt32 *size)
{
	return ReadStreamsPipe(pipeRef, 0, noDataTimeout, completionTimeout, buf, size);
}


IOReturn
IOUSBInterfaceUserClientV3::ReadPipe(UInt8 pipeRef, UInt32 noDataTimeout, UInt32 completionTimeout, IOMemoryDescriptor *mem, IOByteCount *bytesRead)
{
	return ReadStreamsPipe(pipeRef, 0, noDataTimeout, completionTimeout, mem, bytesRead);
}


IOReturn
IOUSBInterfaceUserClientV3::WritePipe(UInt8 pipeRef, UInt32 noDataTimeout, UInt32 completionTimeout, mach_vm_address_t buffer, mach_vm_size_t size, IOUSBCompletion * completion)
{
	return WriteStreamsPipe(pipeRef, 0, noDataTimeout, completionTimeout, buffer, size, completion);
}


IOReturn
IOUSBInterfaceUserClientV3::WritePipe(UInt8 pipeRef, UInt32 noDataTimeout, UInt32 completionTimeout, const void *buf, UInt32 size)
{
	return WriteStreamsPipe(pipeRef, 0, noDataTimeout, completionTimeout, buf, size);
}


IOReturn
IOUSBInterfaceUserClientV3::WritePipe(UInt8 pipeRef, UInt32 noDataTimeout, UInt32 completionTimeout, IOMemoryDescriptor *mem)
{
	return WriteStreamsPipe(pipeRef, 0, noDataTimeout, completionTimeout, mem);
}


#pragma mark Pipe Methods

