apple-open-source/macos/IOUSBFamily/IOUSBUserClient/Classes/IOUSBInterfaceUserClientV3.cpp
//================================================================================================
//
//   _ReadStreamsPipe
//
//   This method is called for both sync and async writes.  In the case of async, the parameters
//   will only be 6 scalars.  In the sync case, it will be 3 scalars and, depending on the size,
//   an inputStructure or an inputIOMD.

//================================================================================================
//
IOReturn IOUSBInterfaceUserClientV3::_ReadStreamsPipe(IOUSBInterfaceUserClientV3 * target, void * reference, IOExternalMethodArguments * arguments)
{
#pragma unused (reference)
	IOReturn								ret;
	
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::_ReadPipe",  target);
	// target->PrintExternalMethodArgs(arguments, 5);
	
	if ( arguments->asyncWakePort )
	{
		IOUSBCompletion							tap;
		IOUSBUserClientAsyncParamBlock *		pb = (IOUSBUserClientAsyncParamBlock*) IOMalloc(sizeof(IOUSBUserClientAsyncParamBlock));
		
        if (!pb)
            return kIOReturnNoMemory;
		
		target->retain();
        target->IncrementOutstandingIO();
        
        bcopy(arguments->asyncReference, pb->fAsyncRef, sizeof(OSAsyncReference64));
        pb->fAsyncCount = arguments->asyncReferenceCount;
        
		tap.target = target;
        tap.action = &IOUSBInterfaceUserClientV3::ReqComplete;
        tap.parameter = pb;
		
		ret = target->ReadStreamsPipe(	(UInt8) arguments->scalarInput[0],				// pipeRef
									  (UInt32) arguments->scalarInput[1],				// streamID
									  (UInt32) arguments->scalarInput[2],				// noDataTimeout
									  (UInt32) arguments->scalarInput[3],				// completionTimeout
									  (mach_vm_address_t) arguments->scalarInput[4],	// buffer (in user task)
									  (mach_vm_size_t) arguments->scalarInput[5],		// size of buffer
									  &tap);											// completion
		
        if ( ret )
		{
            if ( pb )
			{
				IOFree(pb, sizeof(*pb));
			}
			
			target->DecrementOutstandingIO();
			target->release();
		}
	}
	else
	{
		target->retain();
		
		if ( arguments->structureOutputDescriptor )
		{
			ret = target->ReadStreamsPipe(	(UInt8)arguments->scalarInput[0], (UInt32)arguments->scalarInput[1], (UInt32)arguments->scalarInput[2], (UInt32)arguments->scalarInput[3],
								   arguments->structureOutputDescriptor, (IOByteCount *)&(arguments->structureOutputDescriptorSize));
		}
		else
		{
			ret = target->ReadStreamsPipe((UInt8)arguments->scalarInput[0], (UInt32)arguments->scalarInput[1], (UInt32)arguments->scalarInput[2], (UInt32)arguments->scalarInput[3],
								   arguments->structureOutput, (UInt32 *)&(arguments->structureOutputSize));
		}
		
		target->release();
	}
	
	return ret;
}

IOReturn
IOUSBInterfaceUserClientV3::ReadStreamsPipe(UInt8 pipeRef, UInt32 streamID, UInt32 noDataTimeout, UInt32 completionTimeout, mach_vm_address_t buffer, mach_vm_size_t size, IOUSBCompletion * completion)
{
	IOReturn				ret = kIOReturnNotAttached;
    IOMemoryDescriptor *	iomd = NULL;
    IOUSBPipe *				pipeObj = NULL;
    IOUSBPipeV2 *			pipeV2Obj = NULL;
	
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe (Async) (pipeRef: %d, streamID: %d, %d, %d, buffer: 0x%qx, size: %qd, completion: %p)",  this, pipeRef, streamID, (uint32_t)noDataTimeout, (uint32_t)completionTimeout, buffer, size, completion);
    
	if (fOwner && !isInactive())
    {
		if (completion == NULL)
		{
			USBLog(1,"IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe (async) bad arguments (%qd, %qx, %p)",  this, size, buffer, completion);
			//USBTrace( kUSBTInterfaceUserClient,  kTPInterfaceUCReadPipe, size, (uintptr_t)buffer, (uintptr_t)completion, kIOReturnBadArgument );
			ret = kIOReturnBadArgument;
			goto Exit;
		}
		
		pipeObj = GetPipeObj(pipeRef);
		if (pipeObj)
		{
			// This is an Async request
			IOUSBUserClientAsyncParamBlock * pb = (IOUSBUserClientAsyncParamBlock *)completion->parameter;
			
			USBLog(7,"IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe (Async) creating IOMD:  buffer: 0x%qx, size: %qd", this, buffer, size);
			iomd = IOMemoryDescriptor::withAddressRange( buffer, size, kIODirectionIn, fTask);
			if (!iomd)
			{
				USBLog(1,"IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe (async ) IOMemoryDescriptor::withAddressRange returned NULL",  this);
				//USBTrace( kUSBTInterfaceUserClient,  kTPInterfaceUCReadPipe, (uintptr_t)this, size, (uintptr_t)mem, kIOReturnNoMemory );
				ret = kIOReturnNoMemory;
				goto Exit;
			}
			
			USBLog(7,"IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe (async) created IOMD %p",  this, iomd);
			ret = iomd->prepare();
			if ( ret != kIOReturnSuccess)
			{
				USBLog(3,"IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe (async) mem->prepare() returned 0x%x (%s)", this, ret, USBStringFromReturn(ret));
				iomd->release();
				goto Exit;
			}
			
			pb->fMax = size;
			pb->fMem = iomd;
			
			pipeV2Obj = OSDynamicCast(IOUSBPipeV2, pipeObj);
			if ( pipeV2Obj)
				ret = pipeV2Obj->Read(streamID, iomd, noDataTimeout, completionTimeout, size, completion, NULL);
			else
				ret = pipeObj->Read(iomd, noDataTimeout, completionTimeout, completion, NULL);
			if ( ret != kIOReturnSuccess)
			{
				USBLog(5,"IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe (async) returned 0x%x (%s)", this, ret, USBStringFromReturn(ret));
				if (iomd != NULL)
				{
					iomd->complete();
					iomd->release();
				}
			}
		}
		else
		{
			USBLog(5,"IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe (async) can't find pipeRef, returning kIOUSBUnknownPipeErr",  this);
			ret = kIOUSBUnknownPipeErr;
		}
	}
	else
		ret = kIOReturnNotAttached;
	
Exit:
	
	if (pipeObj)
		pipeObj->release();
	
    if (ret)
	{
		USBLog(3, "IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe (async - returning err 0x%x (%s)", this, ret, USBStringFromReturn(ret));
	}
	
	return ret;
}


IOReturn
IOUSBInterfaceUserClientV3::ReadStreamsPipe(UInt8 pipeRef, UInt32 streamID, UInt32 noDataTimeout, UInt32 completionTimeout, void *buffer, UInt32 *size)
{
    IOReturn				ret = kIOReturnSuccess;
    IOMemoryDescriptor *	iomd = NULL;
    IOUSBPipe *				pipeObj = NULL;
    IOUSBPipeV2 *			pipeV2Obj = NULL;
	
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe < 4K (pipeRef: %d, streamID: %d, data timeout: %d, completionTimeout: %d, buffer: %p, size: %d)",  this, pipeRef, streamID, (uint32_t)noDataTimeout, (uint32_t)completionTimeout, buffer, (uint32_t)*size);
    
    IncrementOutstandingIO();				// do this to "hold" ourselves until we complete
    
