apple-open-source/macos/IOUSBFamily/IOUSBUserClient/Classes/IOUSBInterfaceUserClientV3.cpp
    if (fOwner && !isInactive())
    {
		pipeObj = GetPipeObj(pipeRef);
		if (pipeObj)
		{
			IOByteCount count = *size;
			iomd = IOMemoryDescriptor::withAddress( (void *)buffer, *size, kIODirectionIn);
			if (iomd)
			{
				*size = 0;
				ret = iomd->prepare();
				if ( ret == kIOReturnSuccess)
				{
					pipeV2Obj = OSDynamicCast(IOUSBPipeV2, pipeObj);
					if ( pipeV2Obj)
						ret = pipeV2Obj->Read(streamID, iomd, noDataTimeout, completionTimeout, count, NULL, &count);
					else
						ret = pipeObj->Read(iomd, noDataTimeout, completionTimeout, NULL, &count);
					*size = count;
					iomd->complete();
				}
				else
				{
					USBLog(3,"IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe (sync < 4K) mem->prepare() returned 0x%x (%s)", this, ret, USBStringFromReturn(ret));
				}
				iomd->release();
				iomd = NULL;
			}
			else
				ret =  kIOReturnNoMemory;
			pipeObj->release();
		}
		else
			ret = kIOUSBUnknownPipeErr;
    }
    else
        ret = kIOReturnNotAttached;
	
    if (ret)
	{
		USBLog(3, "IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe  (sync < 4K) - returning err %x, size read: %d",  this, ret, (uint32_t)*size);
	}
	
    DecrementOutstandingIO();
	
    return ret;
}



IOReturn
IOUSBInterfaceUserClientV3::ReadStreamsPipe(UInt8 pipeRef, UInt32 streamID, UInt32 noDataTimeout, UInt32 completionTimeout, IOMemoryDescriptor *iomd, IOByteCount *bytesRead)
{
    IOReturn				ret = kIOReturnSuccess;
    IOUSBPipe 			*	pipeObj = NULL;
    IOUSBPipeV2 *			pipeV2Obj = NULL;
	
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe > 4K (pipeRef: %d, streamID: %d, %d, %d, IOMD: %p)",  this, pipeRef, streamID, (uint32_t)noDataTimeout, (uint32_t)completionTimeout, iomd);
	
    IncrementOutstandingIO();				// do this to "hold" ourselves until we complete
    
    if (fOwner && !isInactive())
    {
		pipeObj = GetPipeObj(pipeRef);
		if (pipeObj)
		{
			if (iomd)
			{
				ret = iomd->prepare();
				if (ret == kIOReturnSuccess)
				{
					pipeV2Obj = OSDynamicCast(IOUSBPipeV2, pipeObj);
					if ( pipeV2Obj)
						ret = pipeV2Obj->Read(streamID, iomd, noDataTimeout, completionTimeout, iomd->getLength(), NULL, bytesRead);
					else
						ret = pipeObj->Read(iomd, noDataTimeout, completionTimeout, 0, bytesRead );
					iomd->complete();
				}
				else
				{
					USBLog(3,"IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe (sync > 4K) mem->prepare() returned 0x%x (%s)", this, ret, USBStringFromReturn(ret));
				}
			}
			else
			{
				ret = kIOReturnNoMemory;
			}
			pipeObj->release();
		}
		else
			ret = kIOUSBUnknownPipeErr;
    }
    else
        ret = kIOReturnNotAttached;
	
    if (ret)
	{
		USBLog(3, "IOUSBInterfaceUserClientV3[%p]::ReadStreamsPipe > 4K - returning err 0x%x (%s)", this, ret, USBStringFromReturn(ret));
	}
	
	DecrementOutstandingIO();
	return ret;
}



//================================================================================================
//
//   _WriteStreamsPipe
//
//   This method is called for both sync and async writes.  In the case of async, the parameters
//   will only be 6 scalars.  In the sync case, it will be 4 scalars and, depending on the size,
//   an inputStructure or an inputIOMD.

//================================================================================================
//
IOReturn IOUSBInterfaceUserClientV3::_WriteStreamsPipe(IOUSBInterfaceUserClientV3 * target, void * reference, IOExternalMethodArguments * arguments)
{
#pragma unused (reference)
	IOReturn								ret;
	
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::_WriteStreamsPipe",  target);
	
	if ( arguments->asyncWakePort )
	{
		IOUSBCompletion							tap;
		IOUSBUserClientAsyncParamBlock *		pb = (IOUSBUserClientAsyncParamBlock*) IOMalloc(sizeof(IOUSBUserClientAsyncParamBlock));
		
        if (!pb)
            return kIOReturnNoMemory;
		
		target->retain();
        target->IncrementOutstandingIO();
        
        bcopy(arguments->asyncReference, pb->fAsyncRef, sizeof(OSAsyncReference64));
        pb->fAsyncCount = arguments->asyncReferenceCount;
        
		tap.target = target;
        tap.action = &IOUSBInterfaceUserClientV3::ReqComplete;
        tap.parameter = pb;
		
		ret = target->WriteStreamsPipe(	(UInt8) arguments->scalarInput[0],		// pipeRef
								(UInt32) arguments->scalarInput[1],				// streamID
								(UInt32) arguments->scalarInput[2],				// noDataTimeout
								(UInt32) arguments->scalarInput[3],				// completionTimeout
								(mach_vm_address_t) arguments->scalarInput[4],	// buffer (in user task)
								(mach_vm_size_t) arguments->scalarInput[5],		// size of buffer
								&tap);											// completion
		
        if ( ret )
		{
            if ( pb )
			{
				IOFree(pb, sizeof(*pb));
			}
			
			target->DecrementOutstandingIO();
			target->release();
		}
	}
	else
	{
		target->retain();
		
		if ( arguments->structureInputDescriptor )
		{
			ret = target->WriteStreamsPipe(	(UInt8)arguments->scalarInput[0], (UInt32)arguments->scalarInput[1], (UInt32)arguments->scalarInput[2], (UInt32)arguments->scalarInput[3],
									arguments->structureInputDescriptor);
		}
		else
		{
			ret = target->WriteStreamsPipe((UInt16)arguments->scalarInput[0], (UInt32)arguments->scalarInput[1], (UInt32)arguments->scalarInput[2], (UInt32)arguments->scalarInput[3],
									arguments->structureInput, arguments->structureInputSize);
		}
		
		target->release();
	}
	
	return ret;
}


IOReturn
IOUSBInterfaceUserClientV3::WriteStreamsPipe(UInt8 pipeRef, UInt32 streamID, UInt32 noDataTimeout, UInt32 completionTimeout, mach_vm_address_t buffer, mach_vm_size_t size, IOUSBCompletion * completion)
{
	IOReturn				ret = kIOReturnNotAttached;
    IOMemoryDescriptor *	iomd = NULL;
    IOUSBPipe *				pipeObj = NULL;
    IOUSBPipeV2 *			pipeV2Obj = NULL;
	
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe (Async) (pipeRef: %d, streamID: %d, %d, %d, buffer: 0x%qx, size: %qd, completion: %p)",  this, pipeRef, streamID, (uint32_t)noDataTimeout, (uint32_t)completionTimeout, buffer, size, completion);
    
