apple-open-source/macos/IOUSBFamily/IOUSBUserClient/Classes/IOUSBInterfaceUserClientV3.cpp
	if (fOwner && !isInactive())
    {
		if (completion == NULL )
		{
			USBLog(1,"IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe (async) bad arguments (%qd, %qx, %p)",  this, size, buffer, completion);
			//USBTrace( kUSBTInterfaceUserClient,  kTPInterfaceUCWritePipe, size, buffer, (uintptr_t)completion, kIOReturnBadArgument );
			ret = kIOReturnBadArgument;
			goto Exit;
		}
		
		pipeObj = GetPipeObj(pipeRef);
		if (pipeObj)
		{
			// This is an Async request
			IOUSBUserClientAsyncParamBlock * pb = (IOUSBUserClientAsyncParamBlock *)completion->parameter;
			
			iomd = IOMemoryDescriptor::withAddressRange( buffer, size, kIODirectionOut, fTask);
			if (!iomd)
			{
				USBLog(1,"IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe (async ) IOMemoryDescriptor::withAddressRange returned NULL",  this);
				//USBTrace( kUSBTInterfaceUserClient,  kTPInterfaceUCWritePipe, (uintptr_t)this, size, (uintptr_t)mem, kIOReturnNoMemory );
				ret = kIOReturnNoMemory;
				goto Exit;
			}
			
			USBLog(7,"IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe (async) created IOMD %p",  this, iomd);
			ret = iomd->prepare();
			if ( ret != kIOReturnSuccess)
			{
				USBLog(3,"IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe (async) mem->prepare() returned 0x%x (%s)", this, ret, USBStringFromReturn(ret));
				iomd->release();
				goto Exit;
			}
			
			pb->fMax = size;
			pb->fMem = iomd;
			
			pipeV2Obj = OSDynamicCast(IOUSBPipeV2, pipeObj);
			if ( pipeV2Obj)
				ret = pipeV2Obj->Write(streamID, iomd, noDataTimeout, completionTimeout, size, completion);
			else
				ret = pipeObj->Write(iomd, noDataTimeout, completionTimeout, completion);
			
			if ( ret != kIOReturnSuccess)
			{
				USBLog(5,"IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe (async) returned 0x%x (%s)", this, ret, USBStringFromReturn(ret));
				if (iomd != NULL)
				{
					iomd->complete();
					iomd->release();
				}
			}
		}
		else
		{
			USBLog(5,"IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe (async) can't find pipeRef, returning kIOUSBUnknownPipeErr",  this);
			ret = kIOUSBUnknownPipeErr;
		}
	}
	else
		ret = kIOReturnNotAttached;
	
Exit:
	if (pipeObj)
		pipeObj->release();
	
    if (ret)
	{
		USBLog(3, "IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe (async - returning err 0x%x (%s)", this, ret, USBStringFromReturn(ret));
	}
	
	return ret;
}


IOReturn
IOUSBInterfaceUserClientV3::WriteStreamsPipe(UInt8 pipeRef, UInt32 streamID, UInt32 noDataTimeout, UInt32 completionTimeout, const void *buffer, UInt32 size)
{
    IOReturn				ret = kIOReturnSuccess;
    IOMemoryDescriptor *	iomd = NULL;
    IOUSBPipe *				pipeObj = NULL;
    IOUSBPipeV2 *			pipeV2Obj = NULL;
	
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe < 4K (pipeRef: %d, streamID: %d, %d, %d, buffer: %p, size: %d)",  this, pipeRef, streamID, (uint32_t)noDataTimeout, (uint32_t)completionTimeout, buffer, (uint32_t)size);
    IncrementOutstandingIO();				// do this to "hold" ourselves until we complete
	
    if (fOwner && !isInactive())
    {
		pipeObj = GetPipeObj(pipeRef);
		if (pipeObj)
		{
			// Sync, < 4K
			iomd = IOMemoryDescriptor::withAddress( (void *) buffer, size, kIODirectionOut);
			if (iomd)
			{
				ret = iomd->prepare();
				if ( ret == kIOReturnSuccess)
				{
					pipeV2Obj = OSDynamicCast(IOUSBPipeV2, pipeObj);
					if ( pipeV2Obj)
						ret = pipeV2Obj->Write(streamID, iomd, noDataTimeout, completionTimeout, size, NULL);
					else
					ret = pipeObj->Write(iomd, noDataTimeout, completionTimeout);
					if ( ret != kIOReturnSuccess)
					{
						USBLog(5,"IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe (sync < 4K) returned 0x%x (%s)", this, ret, USBStringFromReturn(ret));
					}
					iomd->complete();
				}
				else
				{
					USBLog(3,"IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe (sync < 4K) mem->prepare() returned 0x%x (%s)", this, ret, USBStringFromReturn(ret));
				}
				
				iomd->release();
				iomd = NULL;
			}
			else
				ret = kIOReturnNoMemory;
			
			pipeObj->release();
		}
		else
			ret = kIOUSBUnknownPipeErr;
    }
    else
        ret = kIOReturnNotAttached;
	
    if (ret)
	{
		USBLog(3, "IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe (sync < 4K) - returning err 0x%x (%s)", this, ret, USBStringFromReturn(ret));
	}
	
    DecrementOutstandingIO();
    return ret;
}


IOReturn
IOUSBInterfaceUserClientV3::WriteStreamsPipe(UInt8 pipeRef, UInt32 streamID, UInt32 noDataTimeout, UInt32 completionTimeout, IOMemoryDescriptor *iomd)
{
    IOReturn				ret;
    IOUSBPipe *				pipeObj = NULL;
    IOUSBPipeV2 *			pipeV2Obj = NULL;
	
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe > 4K (pipeRef: %d, streamID: %d, %d, %d, IOMD: %p)",  this, pipeRef, streamID, (uint32_t)noDataTimeout, (uint32_t)completionTimeout, iomd);
	
	if ( iomd == NULL )
	{
		USBLog(3,"+IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe > 4K  mem was NULL, returning kIOReturnBadArgument",  this);
		return kIOReturnBadArgument;
	}
	
    IncrementOutstandingIO();				// do this to "hold" ourselves until we complete
    
    if (fOwner && !isInactive())
    {
		pipeObj = GetPipeObj(pipeRef);
		if (pipeObj)
		{
			if (iomd)
			{
				ret = iomd->prepare();
				if (ret == kIOReturnSuccess)
				{
					pipeV2Obj = OSDynamicCast(IOUSBPipeV2, pipeObj);
					if ( pipeV2Obj)
						ret = pipeV2Obj->Write(streamID, iomd, noDataTimeout, completionTimeout, iomd->getLength(), NULL);
					else
						ret = pipeObj->Write(iomd, noDataTimeout, completionTimeout );
					iomd->complete();
				}
				else
				{
					USBLog(1,"IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe > (sync > 4K) mem->prepare() returned 0x%x (%s)", this, ret, USBStringFromReturn(ret));
					//USBTrace( kUSBTInterfaceUserClient,  kTPInterfaceUCWritePipe, (uintptr_t)this, ret, 0, 0 );
				}
			}
			else
			{
				ret = kIOReturnNoMemory;
			}
			pipeObj->release();
		}
		else
			ret = kIOUSBUnknownPipeErr;
    }
    else
        ret = kIOReturnNotAttached;
	
    if (ret)
	{
		USBLog(3, "IOUSBInterfaceUserClientV3[%p]::WriteStreamsPipe > 4K - returning err 0x%x (%s)", this, ret, USBStringFromReturn(ret));
	}
	
