apple-open-source/macos/IOUSBFamily/IOUSBUserClient/Classes/IOUSBInterfaceUserClientV3.cpp
    DecrementOutstandingIO();
    return ret;
}


IOReturn
IOUSBInterfaceUserClientV3::_AbortStreamsPipe(IOUSBInterfaceUserClientV3 * target, void * reference, IOExternalMethodArguments * arguments)
{
#pragma unused (reference)
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::_AbortStreamsPipe",  target);
	
	target->retain();
    IOReturn kr = target->AbortStreamsPipe((UInt8)arguments->scalarInput[0], arguments->scalarInput[1]);
	target->release();
	
	return kr;
}

IOReturn
IOUSBInterfaceUserClientV3::AbortStreamsPipe(UInt8 pipeRef, UInt32 streamID)
{
    IOUSBPipe *				pipeObj = NULL;
    IOUSBPipeV2 *			pipeV2Obj = NULL;
    IOReturn		ret;
    
    USBLog(7, "+IOUSBInterfaceUserClientV3[%p]::AbortStreamsPipe (pipeRef: %d, streamID: %d)",  this, pipeRef, streamID);
    
    IncrementOutstandingIO();
    
    if (fOwner && !isInactive())
    {
		pipeObj = GetPipeObj(pipeRef);
		if (pipeObj)
		{
			pipeV2Obj = OSDynamicCast(IOUSBPipeV2, pipeObj);
			if ( pipeV2Obj)
				ret = pipeV2Obj->Abort(streamID);
			else
				ret =  pipeObj->Abort();
			
			pipeObj->release();
		}
		else
			ret = kIOUSBUnknownPipeErr;
    }
    else
        ret = kIOReturnNotAttached;
	
    if (ret)
    {
        if ( ret == kIOUSBUnknownPipeErr || ret == kIOReturnNotAttached)
		{
            USBLog(6, "IOUSBInterfaceUserClientV3[%p]::AbortStreamsPipe(%d) - returning err %x (%s)",  this, pipeRef, ret, USBStringFromReturn(ret));
		}
        else
		{
            USBLog(3, "IOUSBInterfaceUserClientV2[%p]::AbortStreamsPipe(%d) - returning err %x (%s)",  this, pipeRef, ret, USBStringFromReturn(ret));
		}
    }
    
    DecrementOutstandingIO();
    return ret;
}



#pragma mark Padding Methods

OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 0);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 1);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 2);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 3);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 4);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 5);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 6);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 7);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 8);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 9);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 10);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 11);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 12);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 13);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 14);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 15);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 16);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 17);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 18);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 19);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 20);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 21);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 22);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 23);
OSMetaClassDefineReservedUnused(IOUSBInterfaceUserClientV3, 24);


